import numpy as np
import pandas as pd

'''
как оказалось, генераторы случайных чисел выдают... случайные числа!
поэтому с каждым запуском программы невозможно никак нормально работать с какой-то одной конкретной выборкой
пришлось найти генератор, который использует сиды для генерации - теперь задав одно число, мы всегда
на него получим одно и то же число случайное. как будто пронумеровали все случайные числа и индексы
назвали сидами
P.S. оказалось, есть встроенная функция в пандас. можно было сделать одной строкой через choice
'''
def make_selection(df:pd.DataFrame, volume:int = 150):
    rng = np.random.default_rng(112312)
    idx = rng.choice(len(df), size=volume, replace=False)
    return(df.iloc[idx])